app/views/backend/subcategories/_product_list.html.haml

SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = ? AND "subcategories"."id" = ? LIMIT 1  [["category_id", 1], ["id", 1]]
---
= form_tag new_product_path, method: :get
= select_tag 'subcategory_id', options_from_collection_for_select(Subcategory.all, :id, :name, 1)