app/controllers/backend/brands_controller.rb

  def destroy
    @brand.destroy
---
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 2]]

    def set_brand
      @brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 2]]