app/controllers/backend/categories_controller.rb

	def show
		@category = Category.find(params[:id])
		@subcategories = @category.subcategories.all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = ?  [["category_id", 1]]