app/controllers/backend/images_controller.rb

  def destroy
    remove_image_at_index(params[:id].to_i)
    flash[:error] = "Failed deleting image" unless @product.save
---
UPDATE "products" SET "images" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["images", "---\n- download.jpg\n"], ["updated_at", "2016-03-19 08:24:11.922096"], ["id", 1]]

  def set_gallery
    @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]