app/controllers/backend/products_controller.rb

  def index
    if current_user.admin?
      @products = Product.all
    else
      @products = current_user.products.all
    end

    @cat = Category.all
---
SELECT  "products".* FROM "products"  ORDER BY "products"."id" DESC LIMIT 1
SELECT "categories".* FROM "categories"

  def new
    #TODO Refactor, Nasty code
    @product = Product.new(subcategory_id: params[:subcategory_id])
    @subcategory_names = Subcategory.all.map{|sub| [sub.name, sub.id] }
    @supplier_names = Supplier.all.map{|sup| [sup.company, sup.id]}
    @brand_names = Brand.all.map{|br| [br.name, br.id]}
    @default_brand = @brand_names.first
    @default_subcategory = @subcategory_names.first
    @default_supplier  = @subcategory_names.first
    @tax_rates = TaxRate.all.map{|tr| [tr.tax_description, tr.id]}
    @default_tax_rate = @tax_rates.first

    @sizes = Size.all.map{|s| [s.description, s.id]}
---
SELECT "subcategories".* FROM "subcategories"
SELECT "suppliers".* FROM "suppliers"
SELECT "brands".* FROM "brands"
SELECT "tax_rates".* FROM "tax_rates"
SELECT "sizes".* FROM "sizes"

  def edit
    @product = Product.find(params[:id])
    @subcategory_names = Subcategory.all.map{|sub| [sub.name, sub.id] }
    @supplier_names = Supplier.all.map{|sup| [sup.company, sup.id]}
    @brand_names = Brand.all.map{|br| [br.name, br.id]}
    @default_brand =  [@product.brand.name, @product.brand.id ]
    @default_subcategory = [@product.subcategory.name, @product.subcategory.id]
    @default_supplier = [@product.supplier.company, @product.supplier.id]
    @tax_rates = TaxRate.all.map{|tr| [tr.tax_description, tr.id]}
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "subcategories".* FROM "subcategories"
SELECT "suppliers".* FROM "suppliers"
SELECT "brands".* FROM "brands"
SELECT "tax_rates".* FROM "tax_rates"

  def update
    respond_to do |format|
      if @product.update(product_params.except(:images))
---
UPDATE "products" SET "images" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["images", "---\n- btwin.jpeg\n- download.jpg\n"], ["updated_at", "2016-03-19 08:23:49.577548"], ["id", 1]]

  def destroy
    #binding.pry
    @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 4]]