app/controllers/backend/registration_steps_controller.rb

  def show
    @supplier = Supplier.find(params[:supplier_id])
---
SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", 2]]

    def set_supplier
      @supplier = Supplier.find(params[:supplier_id])
      @contact = @supplier.contact
      @addresses = @supplier.address.all
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."supplier_id" = ? LIMIT 1  [["supplier_id", 2]]