app/controllers/backend/sizes_controller.rb

  def index
    @sizes = Size.all
---
SELECT "sizes".* FROM "sizes"

  def destroy
    @size.destroy
---
DELETE FROM "sizes" WHERE "sizes"."id" = ?  [["id", 1]]

    def set_size
      @size = Size.find(params[:id])
---
SELECT  "sizes".* FROM "sizes" WHERE "sizes"."id" = ? LIMIT 1  [["id", 1]]