app/controllers/backend/stock_levels_controller.rb

  def index
    @stock_levels = @product.stock_level.all
---
SELECT "stock_levels".* FROM "stock_levels" WHERE "stock_levels"."product_id" = ?  [["product_id", 1]]

  def create
    @stock_level = @product.stock_level.new(params[:stock_level].permit(:description, :adjustment))
    if @stock_level.save
---
INSERT INTO "stock_levels" ("description", "adjustment", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "dsdd"], ["adjustment", 5], ["product_id", 1], ["created_at", "2016-03-19 07:23:40.599773"], ["updated_at", "2016-03-19 07:23:40.599773"]]