app/controllers/backend/subcategories_controller.rb

	def create
		@category = Category.find(params[:category_id])
    p subcategory_params
		@subcategory = @category.subcategories.create(subcategory_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "subcategories" ("name", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "sa"], ["description", "ds"], ["category_id", 1], ["created_at", "2016-03-19 06:53:27.067696"], ["updated_at", "2016-03-19 06:53:27.067696"]]

  def show
    @products = Product.where(subcategory_id: params[:id] )
---
SELECT  "products".* FROM "products" WHERE "products"."subcategory_id" = ?  ORDER BY "products"."id" DESC LIMIT 1  [["subcategory_id", 1]]

  def set_subcategory
    @category = Category.find(params[:category_id])
    @subcategory = @category.subcategories.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = ? AND "subcategories"."id" = ? LIMIT 1  [["category_id", 1], ["id", 1]]