app/controllers/backend/suppliers_controller.rb

  def create
    @supplier = Supplier.new(supplier_params)
    #supplier_contact = @supplier.build_contact(contact_params)
    #@address = @supplier.address.new()

    #supplier_finance = @supplier.create_finance(finance_params)
    respond_to do |format|
      if @supplier.save #supplier_contact.save #and supplier_address.save and supplier_finance.save
---
INSERT INTO "suppliers" ("company", "code", "status", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["company", "sa"], ["code", "sa"], ["status", "dq"], ["description", "ds"], ["created_at", "2016-03-19 06:55:26.829000"], ["updated_at", "2016-03-19 06:55:26.829000"]]