app/controllers/backend/tax_rates_controller.rb

SELECT "tax_rates".* FROM "tax_rates"
---
  def index
    @tax_rates = TaxRate.all