app/controllers/backend/variants_controller.rb

  def index
    @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

  def new
    @product = Product.find(params[:product_id])
    @variant = @product.variants.new
    @tax_rates = TaxRate.all.map{|tr| [tr.tax_description, tr.id]}
    @default_tax_rate = [@product.tax_rate.tax_description, @product.tax_rate.id]

    @sizes = Size.all.map{|s| [s.description, s.id]}
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tax_rates".* FROM "tax_rates"
SELECT "sizes".* FROM "sizes"

  def create
    @product = Product.find(params[:product_id])
    @variant = @product.variants.new(variants_params)

    if @variant.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "products" ("name", "permalink", "skuid", "price", "cost_price", "tax_rate_id", "size_id", "quantity", "parent_id", "supplier_id", "brand_id", "description", "short_description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
      @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]