app/views/backend/products/_form.html.haml

SELECT "subcategories".* FROM "subcategories"
---
      - if !@product.subcategory.nil?
        - @product.subcategory.fields.each do |field|