app/views/backend/products/_table.html.haml

SELECT "categories".* FROM "categories"
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = ?  [["category_id", 1]]
---
      - categories.each do |category|
        - category.subcategories.each do |subcategory|

SELECT "products".* FROM "products" WHERE "products"."subcategory_id" = ?  [["subcategory_id", 1]]
---
            %th{:colspan => 5}= link_to t(subcategory.name, :default => subcategory.name), category_subcategory_path(subcategory.category, subcategory), :class => 'btn btn-info btn-xs'
            - subcategory.products.each do |product|