app/controllers/brands_controller.rb

INSERT INTO "brands" ("name", "short_description", "description", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @brand = Brand.new(brand_params)

    respond_to do |format|
      if @brand.save

UPDATE "brands" SET "description" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["description", "Expect extream"], ["updated_at", "2016-03-18 05:22:27.074110"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @brand.update(brand_params)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_brand
      @brand = Brand.find(params[:id])