app/controllers/categories_controller.rb

	def create
		@category = Category.new(category_params)
		if @category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bicycle"], ["description", "Sporket Rockets"], ["created_at", "2016-03-18 05:18:12.831706"], ["updated_at", "2016-03-18 05:18:12.831706"]]

	def show
		@category = Category.find(params[:id])
		@subcategories = @category.subcategories.all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = ?  [["category_id", 1]]