app/controllers/products_controller.rb

  def index
    if current_user.admin?
      @products = Product.all
    else
      @products = current_user.products.all
    end

    @cat = Category.all
---
SELECT  "products".* FROM "products"  ORDER BY "products"."id" DESC LIMIT 1
SELECT "categories".* FROM "categories"

  def new
    #TODO Refactor, Nasty code
    @product = Product.new(subcategory_id: params[:subcategory_id])
    @subcategory_names = Subcategory.all.map{|sub| [sub.name, sub.id] }
    @supplier_names = Supplier.all.map{|sup| [sup.company, sup.id]}
    @brand_names = Brand.all.map{|br| [br.name, br.id]}
    @default_brand = @brand_names.first
    @default_subcategory = @subcategory_names.first
    @default_supplier  = @subcategory_names.first
    @tax_rates = TaxRate.all.map{|tr| [tr.tax_description, tr.id]}
    @default_tax_rate = @tax_rates.first

    @sizes = Size.all.map{|s| [s.description, s.id]}
---
SELECT "subcategories".* FROM "subcategories"
SELECT "suppliers".* FROM "suppliers"
SELECT "brands".* FROM "brands"
SELECT "tax_rates".* FROM "tax_rates"
SELECT "sizes".* FROM "sizes"

  def create
    @product = Product.new(product_params)

    @product.user = current_user

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "skuid", "brand_id", "tax_rate_id", "subcategory_id", "supplier_id", "permalink", "description", "short_description", "price", "cost_price", "size_id", "quantity", "images", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)