app/controllers/registration_steps_controller.rb

  def show
    @supplier = Supplier.find(params[:supplier_id])
---
SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @supplier = Supplier.find(params[:supplier_id])

    case step

    when :address
      @supplier = @supplier if update_address
    when :contact
      @supplier = @supplier if update_contact
    when :financial
      @supplier = @supplier.create_finance(finance_params)
---
SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "addresses" ("name", "pincode", "address_line_1", "address_line_2", "city", "state", "country", "supplier_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_supplier
      @supplier = Supplier.find(params[:supplier_id])
      @contact = @supplier.contact
      @addresses = @supplier.address.all
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."supplier_id" = ? LIMIT 1  [["supplier_id", 1]]