app/controllers/sizes_controller.rb

SELECT "sizes".* FROM "sizes"
---
  def index
    @sizes = Size.all

INSERT INTO "sizes" ("name", "volume", "unit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Large"], ["volume", 26.0], ["unit", "inches"], ["created_at", "2016-03-18 05:14:22.033127"], ["updated_at", "2016-03-18 05:14:22.033127"]]
---
  def create
    @size = Size.new(size_params)

    respond_to do |format|
      if @size.save

SELECT  "sizes".* FROM "sizes" WHERE "sizes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_size
      @size = Size.find(params[:id])