app/controllers/subcategories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "subcategories" ("name", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "MTB"], ["description", "From hill to hell"], ["category_id", 1], ["created_at", "2016-03-18 05:18:45.404237"], ["updated_at", "2016-03-18 05:18:45.404237"]]
---
	def create
		@category = Category.find(params[:category_id])
    p subcategory_params
		@subcategory = @category.subcategories.create(subcategory_params)