app/controllers/suppliers_controller.rb

  def create
    @supplier = Supplier.new(supplier_params)
    #supplier_contact = @supplier.build_contact(contact_params)
    #@address = @supplier.address.new()

    #supplier_finance = @supplier.create_finance(finance_params)
    respond_to do |format|
      if @supplier.save #supplier_contact.save #and supplier_address.save and supplier_finance.save
---
INSERT INTO "suppliers" ("company", "code", "status", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["company", "Bike Affiar"], ["code", "BKF"], ["status", "Active"], ["description", ""], ["created_at", "2016-03-18 05:17:01.679079"], ["updated_at", "2016-03-18 05:17:01.679079"]]

    def set_supplier
      @supplier = Supplier.find(params[:id])
      @contact = @supplier.contact
      @addresses = @supplier.address.all
---
SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."supplier_id" = ? LIMIT 1  [["supplier_id", 1]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."supplier_id" = ?  [["supplier_id", 1]]