app/controllers/tax_rates_controller.rb

  def index
    @tax_rates = TaxRate.all
---
SELECT "tax_rates".* FROM "tax_rates"

  def create
    @tax_rate = TaxRate.new(tax_rate_params)

    respond_to do |format|
      if @tax_rate.save
---
INSERT INTO "tax_rates" ("name", "code", "description", "rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "servive tax"], ["code", "VAT"], ["description", ""], ["rate", 5.0], ["created_at", "2016-03-18 05:16:00.746801"], ["updated_at", "2016-03-18 05:16:00.746801"]]

    def set_tax_rate
      @tax_rate = TaxRate.find(params[:id])
---
SELECT  "tax_rates".* FROM "tax_rates" WHERE "tax_rates"."id" = ? LIMIT 1  [["id", 1]]