app/views/products/_form.html.haml

      - if !@product.subcategory.nil?
        - @product.subcategory.fields.each do |field|
---
SELECT "subcategories".* FROM "subcategories"